Enums/ТипыМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ТипыМетаданных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Роль</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИдентификаторыОбъектовМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыОбъектовМетаданных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбщегоНазначенияСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ИндексКартинкиКонтрагента(Тип, ПометкаУдаления = Ложь) Экспорт

	Если Тип = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Если Не ПометкаУдаления Тогда
			Возврат 1;
		Иначе 
			Возврат 3;
		КонецЕсли;
		
	КонецЕсли;
	
	ВызватьИсключение "Нельзя получить индекс картинки контрагента не для контрагента";
	
КонецФункции

Функция ЗначениеРеквизита(Ссылка, ИмяРеквизита) Экспорт
	
	Возврат Ссылка[ИмяРеквизита];
	
КонецФункции

Процедура ОбновитьИдентификаторыОбъектовМетоданных() Экспорт

	Для Каждого Роль Из Метаданные.Роли Цикл
		
		Если Не ЗначениеЗаполнено(Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию(Роль.Имя)) Тогда
			
			НовыйИдентификатор = Справочники.ИдентификаторыОбъектовМетаданных.СоздатьЭлемент();
		    НовыйИдентификатор.Наименование = Роль.Имя;
			НовыйИдентификатор.Синоним = Роль.Синоним;
			НовыйИдентификатор.УИД = Новый УникальныйИдентификатор;
			НовыйИдентификатор.Тип = Перечисления.ТипыМетаданных.Роль;
			НовыйИдентификатор.Записать();
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Функция Модуль(Число) Экспорт

	Возврат ?(Число < 0, -Число, Число);
	
КонецФункции // Модуль()


#КонецОбласти
